{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv1D",
          "config": {
            "filters": 8,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": 42
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.001
              }
            },
            "kernel_constraint": null,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "dilation_rate": [
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv1d_Conv1D1",
            "trainable": true,
            "batch_input_shape": [
              null,
              50,
              1
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization1",
            "trainable": true
          }
        },
        {
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU1",
            "trainable": true
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "pool_size": [
              2
            ],
            "padding": "valid",
            "strides": [
              2
            ],
            "name": "max_pooling1d_MaxPooling1D1",
            "trainable": true
          }
        },
        {
          "class_name": "Conv1D",
          "config": {
            "filters": 16,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": 43
              }
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.001
              }
            },
            "kernel_constraint": null,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "dilation_rate": [
              1
            ],
            "activation": "linear",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv1d_Conv1D2",
            "trainable": true
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization2",
            "trainable": true
          }
        },
        {
          "class_name": "ReLU",
          "config": {
            "max_value": null,
            "name": "re_lu_ReLU2",
            "trainable": true
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "pool_size": [
              2
            ],
            "padding": "valid",
            "strides": [
              2
            ],
            "name": "max_pooling1d_MaxPooling1D2",
            "trainable": true
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_Flatten1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": 44
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": {
              "class_name": "L1L2",
              "config": {
                "l1": 0,
                "l2": 0.001
              }
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 2,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": 45
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "./weights.bin"
      ],
      "weights": [
        {
          "name": "conv1d_Conv1D1/kernel",
          "shape": [
            3,
            1,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D1/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/gamma",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/beta",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D2/kernel",
          "shape": [
            3,
            8,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D2/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/gamma",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/beta",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            192,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            32,
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_mean",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_variance",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_mean",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_variance",
          "shape": [
            16
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}